//============================================================================
//
//カメラの処理[camera.h] (ファイルヘッダコメント)
//Author:谷本康輔
//============================================================================
#ifndef _CAMERA_H_						//このマクロ定義がされてなかったら
#define _CAMERA_H_						//2連インクルード防止のマクロ定義

#include "main.h"		//作成したmain.hをインクルードする

//****************************************************************************
//マクロ定義
//****************************************************************************
#define CAMERA_NEAR				(10)	//カメラのニアー
#define CAMERA_FAR				(3000)	//カメラのファー
#define CAMERA_SPEAD			(2)		//カメラの移動速度

//****************************************************************************
//構造体定義
//****************************************************************************
typedef struct
{
	D3DXVECTOR3 posV;			//視点
	D3DXVECTOR3 posR;			//注視点
	D3DXVECTOR3 posVDest;		//目的の視点
	D3DXVECTOR3 posRDest;		//目的の注視点
	D3DXVECTOR3 vecU;			//上方向ベクトル
	D3DXVECTOR3 rot;			//方向
	D3DXVECTOR3 rotDest;		//目的の方向
	D3DXMATRIX mtxProjection;	//プロジェクションマトリックス
	D3DXMATRIX mtxView;			//ビューマトリックス
	float fDistance;			//視点から注視点の距離
	bool bFollowUse;			//追従機能判定
}CAMERA;

//****************************************************************************
//プロトタイプ宣言
//****************************************************************************
void InitCamera(void);
void UninitCamera(void);
void UpdateCamera(void);
void SetCamera(void);
CAMERA *GetCamera(void);

#endif #pragma once
