//============================================================================
//
//エフェクトの処理[effect.h] (ファイルヘッダコメント)
//Author:谷本康輔
//============================================================================
#ifndef _EFFECT_H_						//このマクロ定義がされてなかったら
#define _EFFECT_H_						//2連インクルード防止のマクロ定義

#include "main.h"		//作成したmain.hをインクルードする

//****************************************************************************
//マクロ定義
//****************************************************************************
#define MAX_EFFECT				(255)	//エフェクトの最大数
#define EFFECT_LIFE				(100)	//エフェクトの寿命
#define EFFECT_WIDTH			(10)	//エフェクトの横幅
#define EFFECT_HEIGHT			(10)	//エフェクトの縦幅

//****************************************************************************
//エフェクトの種類の定義
//****************************************************************************
//エフェクトの種類
typedef enum
{
	EFFECT_TYPE_BULLET = 0,	//ビルボード(弾)
	EFFECT_TYPE_MAX
}EFFECT_TYPE;

//****************************************************************************
//構造体定義
//****************************************************************************
//頂点情報[3D]の構造体を定義
typedef struct
{
	D3DXVECTOR3 pos;	//頂点座標
	D3DXVECTOR3 move;	//移動量
	D3DXVECTOR3 rot;	//向き
	D3DXMATRIX Worldmtx;//ワールドマトリックス
	D3DCOLOR col;		//頂点カラー
	int life;			//エフェクトの寿命
	bool bUse;
	float fAngle;		//角度(アークタンジェント)
	float fLength;		//長さ(スクウェアルート)
	EFFECT_TYPE type;
}EFFECT;

//****************************************************************************
//プロトタイプ宣言
//****************************************************************************
void InitEffect(void);
void UninitEffect(void);
void UpdateEffect(void);
void DrawEffect(void);
void SetEffect(D3DXVECTOR3 pos, D3DXVECTOR3 move,D3DXVECTOR3 rot, int nLife, EFFECT_TYPE type);

#endif 
