//============================================================================
//
//メッシュ円柱の処理[meshcylinder.h] (ファイルヘッダコメント)
//Author:谷本康輔
//============================================================================
#ifndef _MESHCYLINDER_H_						//このマクロ定義がされてなかったら
#define _MESHCYLINDER_H_						//2連インクルード防止のマクロ定義

#include "main.h"		//作成したmain.hをインクルードする

//****************************************************************************
//マクロ定義
//****************************************************************************
#define MESHCYLINDER_WIDTH			(25)	//メッシュ円柱の横幅
#define MESHCYLINDER_HEIGHT			(25)	//メッシュ円柱の縦幅
#define MAX_MESHCYLINDER			(20)	//メッシュの円柱最大数

//****************************************************************************
//構造体定義
//****************************************************************************
//頂点情報[3D]の構造体を定義
typedef struct
{
	D3DXVECTOR3 pos;	//頂点座標
	D3DXVECTOR3 nor;	//法線ベクトル
	D3DXVECTOR3 rot;	//向き
	D3DXMATRIX Worldmtx;//ワールドマトリックス
	D3DCOLOR col;		//頂点カラー
	int nMeshX;			//x軸の個数
	int nMeshZ;			//z軸の個数
	float fAngle;		//角度(アークタンジェント)
	float fLength;		//長さ(スクウェアルート)
}MESHCYLINDER;

//****************************************************************************
//プロトタイプ宣言
//****************************************************************************
void InitMeshCylinder(void);
void UninitMeshCylinder(void);
void UpdateMeshCylinder(void);
void DrawMeshCylinder(void);

#endif 