//============================================================================
//
//ポリゴン描画の処理[polygon.h] (ファイルヘッダコメント)
//Author:谷本康輔
//============================================================================
#ifndef _POLYGON_H_						//このマクロ定義がされてなかったら
#define _POLYGON_H_						//2連インクルード防止のマクロ定義

#include "main.h"		//作成したmain.hをインクルードする

//****************************************************************************
//マクロ定義
//****************************************************************************
#define POLYGON_WIDTH			(100)	//ポリゴンの横幅
#define POLYGON_HEIGHT			(100)	//ポリゴンの縦幅
//****************************************************************************
//構造体定義
//****************************************************************************
//頂点情報[3D]の構造体を定義
typedef struct
{
	D3DXVECTOR3 pos;	//頂点座標
	D3DXVECTOR3 nor;	//法線ベクトル
	D3DXVECTOR3 rot;	//向き
	D3DXMATRIX Worldmtx;//ワールドマトリックス
	D3DCOLOR col;		//頂点カラー
	float fAngle;		//角度(アークタンジェント)
	float fLength;		//長さ(スクウェアルート)

}POLYGON;

//****************************************************************************
//プロトタイプ宣言
//****************************************************************************
void InitPolygon(void);
void UninitPolygon(void);
void UpdatePolygon(void);
void DrawPolygon(void);

#endif 