//============================================================================
//
//弾の処理[bullet.h] (ファイルヘッダコメント)
//Author:谷本康輔
//============================================================================
#ifndef _BULLET_H_
#define _BULLET_H_

#include "main.h"

//****************************************************************************
//マクロ定義
//****************************************************************************
#define MAX_BULLET				(128)	//弾の最大数
#define BULLET_WIDTH			(40)	//弾の横サイズ
#define BULLET_HEIGHT			(20)	//弾の縦サイズ
#define MAX_BULLET_LIFE			(20)	//扱う弾の最大寿命

//****************************************************************************
//弾構造体の定義
//****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	D3DXVECTOR3 move;	//移動量
	D3DXVECTOR3 rot;	//向き
	D3DXCOLOR	col;	//色
	int nLife;			//寿命
	bool bUse;			//使用判定
}Bullet;

//****************************************************************************
//プロトタイプ宣言
//****************************************************************************
void InitBullet(void);
void UninitBullet(void);
void UpdateBullet(void);
void DrawBullet(void);
void SetBullet(D3DXVECTOR3 pos, D3DXVECTOR3 move);

#endif