//============================================================================
//
//白の処理[white.h] (ファイルヘッダコメント)
//Author:谷本康輔
//============================================================================
#ifndef _WHITE_H_
#define _WHITE_H_

#include "main.h"

//****************************************************************************
//マクロ定義
//****************************************************************************
#define MAX_SCORE_WHITE			(99999999)	//白の最大数
#define MAX_WHITE_DIGIT			(4)			//白の最大桁数
#define BASE_WHITE_NUMBER		(10)		//進数
#define WHITE_WIDTH				(40)		//白の横サイズ
#define WHITE_HEIGHT			(60)		//白の縦サイズ

//****************************************************************************
//弾構造体の定義
//****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	D3DXVECTOR3 move;	//移動量
	D3DXVECTOR3 rot;	//回転
	D3DXCOLOR	col;	//色
	float fAngle;		//角度(アークタンジェント)
	float fLength;		//長さ(スクウェアルート)
}White;

//****************************************************************************
//プロトタイプ宣言
//****************************************************************************
void InitWhite(void);
void UninitWhite(void);
void UpdateWhite(void);
void DrawWhite(void);
void SetWhite(int nWhite);
void AddWhite(int nValue);

#endif