//============================================================================
//
//爆発処理[explosion.h] (ファイルヘッダコメント)
//Author:谷本康輔
//============================================================================
#ifndef _EXPLOSION_H_
#define _EXPLOSION_H_
#include "main.h"

//****************************************************************************
//マクロ定義
//****************************************************************************
#define EXPLOSION_WIDTH			(200)	//爆発画像の横幅
#define EXPLOSION_HEIGHT		(200)	//爆発画像の縦幅
#define MAX_EXPLOSION			(128)	//爆発の最大数
#define EXPLOSION_ANIM_CNT		(8)		//扱うアニメーションカウンターの最大個数

//****************************************************************************
//弾構造体の定義
//****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	D3DXCOLOR	col;	//色
	D3DXVECTOR3 rot;	//向き
	int nPatternAnim;	//アニメーションパターン
	bool bUse;			//使用判定
}Explosion;

//****************************************************************************
//プロトタイプ宣言
//****************************************************************************
void InitExplosion(void);
void UninitExplosion(void);
void UpdateExplosion(void);
void DrawExplosion(void);
void SetExplosion(D3DXVECTOR3 pos,D3DXCOLOR col);

#endif