//============================================================================
//
//キーボード入力処理[input.h] (ファイルヘッダコメント)
//Author:谷本康輔
//============================================================================
#ifndef _INPUT_H_
#define _INPUT_H_
#include "main.h"

//************************************************
//マクロ定義
//************************************************
#define NUM_KEY_MAX		(256)	//キーの最大数

//============================================================================
//プロトタイプ宣言
//============================================================================
HRESULT InitKeyboard(HINSTANCE hInstance, HWND hWnd);
void UninitKeyboard(void);
void UpdateKeyboard(void);
bool GetKeyboardPress(int nKey);
bool GetKeyboardTrigger(int nKey);

#endif