//=============================================================================
//
// 敵キャラの管理　　　enemy_manager.cpp
// Author : Tanimoto Kosuke
//
//=============================================================================
#include "enemy_manager.h"

//=====================================
// デフォルトコンストラクタ
//=====================================
CEnemyManager::CEnemyManager()
{
}

//=====================================
// デストラクタ
//=====================================
CEnemyManager::~CEnemyManager()
{
	// 全ての敵キャラの解放
	m_AllEnemy.clear();
}