//=============================================================================
//
// fog.h (フォグ.h)
// Author : Saito Shian
//
//=============================================================================
#ifndef  _FOG_H_				//このマクロ定義がされてなかったら
#define  _FOG_H_				//二重インクルード防止のマクロ定義

//=============================================================================
// インクルード
//=============================================================================
#include "main.h"
#include "object.h"

#include <d3dx9.h>
#include <tchar.h> // _T
#include <assert.h>

//=============================================================================
// 前方宣言
//=============================================================================

//=============================================================================
// フォグクラス
//=============================================================================
class CFog
{
public:
	CFog();				// フォグのコンストラクタ
	~CFog();			// フォグのデストラクタ

	static void SetFog(D3DXCOLOR col, const float intensity = 0.00005f);	// フォグの設定処理
	static void DestroyFog();			// フォグの終了処理

private:
	static bool m_bCreate;
	static bool m_bIntensityFlag;
	static float m_fIntensity;
	static float m_fIntensityDest;

	static float m_fFogStartPos;
	static float m_fFogEndPos;
};
#endif