//============================================================================
//
//ライフの処理[life.h] (ファイルヘッダコメント)
//Author:谷本康輔
//============================================================================
#ifndef _LIFE_H_
#define _LIFE_H_

#include "main.h"

//****************************************************************************
//マクロ定義
//****************************************************************************
#define LIFE_WIDTH		(40)	//ライフの横サイズ
#define LIFE_HEIGHT		(40)	//ライフの縦サイズ

//****************************************************************************
//構造体の定義
//****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	D3DXVECTOR3 rot;	//回転
	D3DXCOLOR	col;	//色
	float fAngle;		//角度(アークタンジェント)
	float fLength;		//長さ(スクウェアルート)
	bool bUse;			//使用判定
}Life;

//****************************************************************************
//プロトタイプ宣言
//****************************************************************************
void InitLife(void);
void UninitLife(void);
void UpdateLife(void);
void DrawLife(void);

#endif