//============================================================================
//
//メッシュポリゴンの処理[meshfield.h] (ファイルヘッダコメント)
//Author:谷本康輔
//============================================================================
#ifndef _MESHFIELD_H_						//このマクロ定義がされてなかったら
#define _MESHFIELD_H_						//2連インクルード防止のマクロ定義

#include "main.h"		//作成したmain.hをインクルードする

//****************************************************************************
//マクロ定義
//****************************************************************************
#define MESHFIELD_WIDTH			(50)	//メッシュポリゴンの横幅
#define MESHFIELD_HEIGHT		(50)	//メッシュポリゴンの縦幅
#define MAX_MESHFIELD			(15)	//メッシュのポリゴン最大数
//****************************************************************************
//構造体定義
//****************************************************************************
//頂点情報[3D]の構造体を定義
typedef struct
{
	D3DXVECTOR3 pos;	//頂点座標
	D3DXVECTOR3 nor;	//法線ベクトル
	D3DXVECTOR3 rot;	//向き
	D3DXMATRIX Worldmtx;//ワールドマトリックス
	D3DCOLOR col;		//頂点カラー
	int nMeshX;			//x軸の個数
	int nMeshZ;			//z軸の個数
	float fAngle;		//角度(アークタンジェント)
	float fLength;		//長さ(スクウェアルート)
}MESHFIELD;

//****************************************************************************
//プロトタイプ宣言
//****************************************************************************
void InitMeshField(void);
void UninitMeshField(void);
void UpdateMeshField(void);
void DrawMeshField(void);
bool FieldCollision(D3DXVECTOR3 *pos, D3DXVECTOR3 *posOld, D3DXVECTOR3 *move);

#endif 