//==============================================================================
//
// logo.h	(ロゴ.h)
// Author : Saito Shian
//
//==============================================================================

//==============================================================================
// 2重インクルードガード
//==============================================================================
#ifndef _LOGO_H_
#define	_LOGO_H_

//==============================================================================
// インクルード
//==============================================================================
#include "object2D.h"

//==============================================================================
// マクロ定義
//==============================================================================

//==============================================================================
// 前方宣言
//==============================================================================

//==============================================================================
// ロゴクラス
//==============================================================================
class CLogo : public CObject2D
{
public:
	enum Ranking
	{
		Ranking_1 = 0,
		Ranking_2,
		Ranking_3,
		Ranking_4
	};
	CLogo();						// コンストラクタ
	~CLogo();						// デストラクタ

	HRESULT Init()override;			// 初期化処理
	void Update()override;			// 更新処理

	void LogoBehavior();			// 1P～4Pのロゴの挙動

	void SetScore(int score) { m_nScore = score; }
	int GetScore() { return m_nScore; }

	static CLogo *Create(D3DXVECTOR3 pos, float xsize, float ysize, float moving);

private:
	static int m_nScore;			// スコア
	D3DXVECTOR3 m_rot;				// 回転
	D3DXVECTOR3 m_pos;				// 位置
	D3DXVECTOR3 m_move;				// 移動量
	D3DXCOLOR m_nCol;

	Ranking m_Type;

	float m_fMaxMoving;
	float m_nAlpha;

	bool m_be;
};

#endif

