//==============================================================================================
//
// shop.cpp
//
// tutida ryousei
// tanimoto kosuke
//
//==============================================================================================
#include"shop.h"
#include"stage_select.h"

//==============================================================================================
// コンストラクタ
//==============================================================================================
CShop::CShop()
{
}

//==============================================================================================
// デストラクタ
//==============================================================================================
CShop::~CShop()
{
}

//==============================================================================================
// 初期化処理
//==============================================================================================
HRESULT CShop::Init()
{
	// オブジェクトXの初期化処理
	CObjectX::Init();

	return S_OK;
}

//==============================================================================================
// 終了処理
//==============================================================================================
void CShop::Uninit()
{
	// オブジェクトXの終了処理
	CObjectX::Uninit();

	// UXを使用中の場合
	if (m_pSaleUX != nullptr)
	{
		// UXの終了
		m_pSaleUX->Uninit();
		m_pSaleUX = nullptr;
	}
}

//==============================================================================================
// 更新処理
//==============================================================================================
void CShop::Update()
{
	// オブジェクトXの更新処理
	CObjectX::Update();
}

//==============================================================================================
// 描画処理
//==============================================================================================
void CShop::Draw()
{
	// オブジェクトXの描画処理
	CObjectX::Draw();
}

//==============================================================================================
// 生成処理
//==============================================================================================
CShop *CShop::Create(const D3DXVECTOR3 pos, const D3DXVECTOR3 rot)
{
	CShop *pShop = new CShop;

	if (FAILED(pShop->Init()))
	{
		return nullptr;
	}
	pShop->SetPos(pos);
	pShop->SetRot(rot);
	pShop->SetSize({ 1.0f, 1.0f, 1.0f });

	// ステージ毎にモデルを変更する
	switch (CStage_Select::GetStage_Number())
	{
	case CStage_Select::STAGE_1:
		pShop->SetIndex(ReadObject("Data/model/Pawn_Shop/Stage_01/pawnshop.x"));
		break;
	case CStage_Select::STAGE_2:
		pShop->SetIndex(ReadObject("Data/model/Pawn_Shop/Stage_02/oldpawnshop.x"));
		break;
	case CStage_Select::STAGE_3:
		pShop->SetIndex(ReadObject("Data/model/Pawn_Shop/Stage_03/Spaceship.x"));
		break;
	default:
		break;
	}

	pShop->m_pSaleUX = CObject3D::Create({ pos.x, pos.y + 100.0f, pos.z }, { 80.0f, 80.0f, 0.0f }, { 1.0f, 1.0f, 1.0f, 1.0f }, 4, true);
	pShop->m_pSaleUX->SetTexture(CTexture::TEXTURE_SALE);
	pShop->m_pSaleUX->SetDrawFlag(false);	// 始めは表示しない

	return pShop;
}