//==============================================================================
//
// result_obj.h	(リザルトのオブジェクト.h)
// Author : Saito Shian
//
//==============================================================================

//==============================================================================
// 2重インクルードガード
//==============================================================================
#ifndef _RESULT_OBJ_H_
#define	_RESULT_OBJ_H_

//==============================================================================
// インクルード
//==============================================================================
#include "main.h"
#include "objectX.h"

//==============================================================================
// 前方宣言
//==============================================================================
class CScore;

//==============================================================================
// マップクラス
//==============================================================================
class CResultObj : public CObjectX
{
	static const float Moving_OreSpeed;
public:
	CResultObj();					// コンストラクタ
	~CResultObj();					// デストラクタ

	HRESULT Init()override;			// 初期化処理
	void Update()override;			// 更新処理

	void ObjectBehavior();			// オブジェクトの挙動

	static CResultObj *Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 size, int index);

private:

	D3DXVECTOR3 m_rot;					// 回転
	D3DXVECTOR3 m_pos;					// 位置
	D3DXVECTOR3 m_OreMove;				// 鉱石の移動量

	float m_RandX;						// ランダムのx値
	float m_RandY;						// ランダムのy値
	float m_RandRotX;					// 回転のランダムx値
	float m_LogoMove;					// ロゴの移動量
};

#endif

