//=============================================================================
//
// scoreitemmanager.cpp
// Author : Tanimoto Kosuke
//
//=============================================================================
#include "scoreitemmanager.h"

//=====================================
// デフォルトコンストラクタ
//=====================================
CScoreItemManager::CScoreItemManager()
{
}

//=====================================
// デストラクタ
//=====================================
CScoreItemManager::~CScoreItemManager()
{
	// 全てのスコアアイテムの解放
	m_AllScoreItem.clear();
}