//==============================================================================================
//
// 質屋の方向　　　shop_direction.cpp
// tutida ryousei
//
//==============================================================================================
#include"shop_direction.h"

//==============================================================================================
// コンストラクタ
//==============================================================================================
CShop_Direction::CShop_Direction()
{
}

//==============================================================================================
// デストラクタ
//==============================================================================================
CShop_Direction::~CShop_Direction()
{
}

//==============================================================================================
// 初期化処理
//==============================================================================================
HRESULT CShop_Direction::Init()
{
	CObject3D::Init();
	
	// 矢印
	SetTexture(CTexture::TEXTURE_SHOP_DIRECTION);

	// ドルマーク
	m_Daller = CObject3D::Create(m_Pos, { 100.0f,100.0f,0.0f }, { 1.0f,1.0f,1.0f,1.0f }, 4, true);
	m_Daller->SetTexture(CTexture::TEXTURE_DALLER);

	return S_OK;
}

//==============================================================================================
// 終了処理
//==============================================================================================
void CShop_Direction::Uninit()
{
	CObject3D::Uninit();
}

//==============================================================================================
// 更新処理
//==============================================================================================
void CShop_Direction::Update()
{
	CObject3D::Update();

	if (m_Daller != nullptr)
	{
		// ドルマークの色
		m_Daller->SetCol({ 0.0f,0.0f,0.0f,0.0f });

		if (m_bDaller)
		{
			// 位置
			m_Daller->SetPos(m_Pos + m_ShopVec * 130);
			m_Daller->SetCol({ 1.0f,1.0f,1.0f,1.0f });
		}
	}

	SetPos(m_Pos + m_ShopVec * 130);
	SetRot(m_Rot);
}

//==============================================================================================
// 描画処理
//==============================================================================================
void CShop_Direction::Draw()
{
	CObject3D::Draw();
}

//==============================================================================================
// 生成処理
//==============================================================================================
CShop_Direction *CShop_Direction::Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 size)
{
	CShop_Direction *pShop_Direction = nullptr;

	pShop_Direction = new CShop_Direction;

	if (pShop_Direction != nullptr)
	{
		pShop_Direction->Init();
		pShop_Direction->SetPos_Direction(pos);
		pShop_Direction->SetRot_Direction(rot);
		pShop_Direction->SetSize(size);
		pShop_Direction->Setbillboard(false);
	}

	return pShop_Direction;
}