//=========================================
// 
// bgm(ヘッダーファイル)
// Author Tanimoto
// 
// Update 22/03/24
//
//=========================================
#ifndef _BGM_H_
#define _BGM_H_

#include "main.h"


//****************************************************************************
//BGMの種類
//****************************************************************************
typedef enum
{
	BGM_TYPE_1 = 0,	//BGM1
	BGM_TYPE_2,		//BGM2
	BGM_TYPE_3,		//BGM3
	BGM_TYPE_MAX
}BGM_TYPE;

//------------------------------------
//マクロ定義
//------------------------------------
#define MAX_BGM	(BGM_TYPE_MAX)

//------------------------------------
//BGMの構造体
//------------------------------------
typedef struct
{
	BGM_TYPE type;
}BGM;
//------------------------------------
//プロトタイプ宣言
//------------------------------------
void InitBgm(void);
void UninitBgm(void);
void UpdateBgm(void);
void DrawBgm(void);
void SetBgm(void);

#endif